KORLINX/KORLINX-nRF52-Arduino/boards.txt
menu.softdevice=SoftDevice
menu.debug=Debug Level
menu.debug_output=Debug Port

# -----------------------------------
# KORLINX NX40 nRF52840
# -----------------------------------
nx40.name=NX40 nRF52840

# VID/PID for bootloader and sketch
nx40.vid.0=0x1209
nx40.pid.0=0x4E58

# Upload
nx40.bootloader.tool=bootburn
nx40.upload.tool=nrfutil
nx40.upload.protocol=nrfutil
nx40.upload.use_1200bps_touch=true
nx40.upload.wait_for_upload_port=true
nx40.upload.maximum_size=815104
nx40.upload.maximum_data_size=237568

# Build
nx40.build.mcu=cortex-m4
nx40.build.f_cpu=64000000
nx40.build.board=NX40_NRF52840
nx40.build.core=nRF5
nx40.build.variant=nx40_nrf52840
nx40.build.usb_manufacturer="KORLINX"
nx40.build.usb_product="NX40 nRF52840"
nx40.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
nx40.build.ldscript=nrf52840_s140_v6.ld
nx40.build.openocdscript=scripts/openocd/daplink_nrf52.cfg
nx40.build.vid=0x1209
nx40.build.pid=0x4E58
nx40.build.uf2_family=0xADA52840

# Menu: SoftDevice
nx40.menu.softdevice.s140v6=S140 6.1.1
nx40.menu.softdevice.s140v6.build.sd_name=s140
nx40.menu.softdevice.s140v6.build.sd_version=6.1.1
nx40.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# Menu: Debug Level
nx40.menu.debug.l0=Level 0 (Release)
nx40.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
nx40.menu.debug.l1=Level 1 (Error Message)
nx40.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
nx40.menu.debug.l2=Level 2 (Full Debug)
nx40.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
nx40.menu.debug.l3=Level 3 (Segger SystemView)
nx40.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
nx40.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# Menu: Debug Port
nx40.menu.debug_output.serial=Serial
nx40.menu.debug_output.serial.build.logger_flags=-DCFG_LOGGER=0
nx40.menu.debug_output.serial1=Serial1
nx40.menu.debug_output.serial1.build.logger_flags=-DCFG_LOGGER=1 -DCFG_TUSB_DEBUG=CFG_DEBUG
nx40.menu.debug_output.rtt=Segger RTT
nx40.menu.debug_output.rtt.build.logger_flags=-DCFG_LOGGER=2 -DCFG_TUSB_DEBUG=CFG_DEBUG -DSEGGER_RTT_MODE_DEFAULT=SEGGER_RTT_MODE_BLOCK_IF_FIFO_FULL
